InterviewPreparationHtml.tex
% Created 2021-05-20 Thu 17:01
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[right=0.5in, left=0.5in, top=0.5in, bottom=0.5in]{geometry}
\setcounter{secnumdepth}{0}
\author{Abul Kalam Robin}
\date{\today}
\title{Interview Questions HTML}
\hypersetup{
 pdfauthor={Abul Kalam Robin},
 pdftitle={Interview Questions HTML},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.2 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section*{HTML Questions  \addcontentsline{toc} {section} {HTML Questions}}
\label{sec:orga296292}
\begin{enumerate}
\item What is HTML
\item What are tags
\item Do all HTML tags have an end tag?
\item What is formatting in HTML?
\item How many types of heading does an HTML contain?
\item How to create a hyperlink in HTML?
\item Which HTML tag is used to display the data in the tabular form?
\item What are some common lists that are used when designing a page?
\item What is the difference between HTML elements and tags?
\item What is semantic HTML?
\item What are semantic elements?
\item What are non semantic elements?
\item What is an image map?
\item How to insert a copyright symbol on a browser page?
\item How to create a nested webpage in HTML?
\item How do you keep list elements straight in an HTML file?
\item Does a hyperlink only apply to text?
\item What is a style sheet?
\item Can you create a multi-colored text on a web page?
\item Is it possible to change the color of the bullet?
\item Explain the layout of HTML?
\item <header>: It is used to define a header for a document or a section.
\item What is a marquee?
\item How many tags can be used to separate a section of texts?
\item What are empty elements?
\item What is the use of a span tag? Give one example.
\item What are the entities in HTML?
\item Why is a URL encoded in HTML?
\item Does a <!DOCTYPE html> tag is a HTML tag?
\item What is the canvas element in HTML5?
\item What is SVG?
\item What are the different new form element types in HTML5?
\item Is there any need to change the web browsers to support HTML5?
\item Which type of video formats are supported by HTML5?
\item Is audio tag supported in HTML5?
\item What is the difference between progress and meter tag?
\item What is the use of figure tag in HTML5?
\item What is the use of figcaption tag in HTML5?
\item What is button tag?
\item What is the use of details and summary tag?
\item What is datalist tag?
\item How are tags migrated from HTML4 to HTML5?
\item If you do not put <!DOCTYPE html>, will HTML5 work?
\item Why do you need doctype?
\item What are data-* attributes used for?
\item How can you generate a public key in html?
\item How do you change the direction of html text?
\item How can you highlight text in html?
\item Can you apply CSS to a part of html document only?
\item Will a browser make http request for the following cases?
\item Which resource would be downloaded first?
\item What is an optional tag?
\item What are the differences between div and span?
\item How would you differentiate between div, section, and article?
\item How would you select svg or canvas for your site?
\item How to serve html in multiple languages?
\item Explain standard and quirks mode.
\item What is a semantic tag?
\end{enumerate}
\end{document}
